configuration/src/Catalogs/СтатусыОбъектов/СтатусыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыОбъектов</name>
  <comment>Хранит  элементы, соответствующие определенным статусам объектов.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CodeReview</name>
      <description>Code review</description>
    </items>
    <items>
      <name>DesignReview</name>
      <description>Design review</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>ВРеализацию</name>
      <description>В реализацию</description>
    </items>
    <items>
      <name>Внедрение</name>
      <description>Внедрение</description>
    </items>
    <items>
      <name>ВнутреннееТестирование</name>
      <description>Внутреннее тестирование</description>
    </items>
    <items>
      <name>Документирование</name>
      <description>Документирование</description>
    </items>
    <items>
      <name>ЗапросТребований</name>
      <description>Запрос требований</description>
    </items>
    <items>
      <name>Масштабирование</name>
      <description>Масштабирование</description>
    </items>
    <items>
      <name>НаДоработку</name>
      <description>На доработку</description>
    </items>
    <items>
      <name>Рассмотрение</name>
      <description>На рассмотрении</description>
    </items>
    <items>
      <name>Новый</name>
      <description>Новый</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонен</description>
    </items>
    <items>
      <name>Отложен</name>
      <description>Отложен</description>
    </items>
    <items>
      <name>Приостановлен</name>
      <description>Приостановлен</description>
    </items>
    <items>
      <name>Проработка</name>
      <description>Проработка</description>
    </items>
    <items>
      <name>Протестирован</name>
      <description>Протестирован</description>
    </items>
    <items>
      <name>Публикация</name>
      <description>Публикация</description>
    </items>
    <items>
      <name>Рассмотрен</name>
      <description>Рассмотрен</description>
    </items>
    <items>
      <name>РевьюТребований</name>
      <description>Ревью требований</description>
    </items>
    <items>
      <name>Решен</name>
      <description>Решен</description>
    </items>
    <items>
      <name>Тестирование</name>
      <description>Тестирование</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяКартинкиВБиблиотеке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЗафиксирован</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс изображения в общей картинке СтатусыОбъектов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядковый номер статуса</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПричиныИзмененияСтатуса</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныИзмененияСтатусов</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/СтатусыОбъектов/Forms/ФормаЭлемента/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	  
	ОписанияСтатусов = Справочники.СтатусыОбъектов.ПолучитьСписокКартинокДляСтатусов();     
	
	Если Объект.Предопределенный Тогда
		Элементы.СтраницыРеквизитов.ТекущаяСтраница = Элементы.СтраницаСлужебныйСтатус;
	Иначе
		Элементы.СтраницыРеквизитов.ТекущаяСтраница = Элементы.СтраницаПользовательскийСтатус;
	КонецЕсли;
	
	СписокВыбора = Элементы.ИндексКартинки.СписокВыбора;
	СписокВыбораВторой = Элементы.ИндексКартинки1.СписокВыбора;
	Для Каждого ЭлементСписка Из ОписанияСтатусов Цикл
		СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, , ЭлементСписка.Картинка);
		СписокВыбораВторой.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, , ЭлементСписка.Картинка);
	КонецЦикла;
	
	ЗаполнитьСписокПричинИзмененияСтатуса();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ПричиныИзмененияСтатуса.Очистить();
	ИспользуемыеПричины = ПричиныИзменения.НайтиСтроки(Новый Структура("Использовать", Истина));
	
	Порядок = 0;
	Для Каждого Строка Из ИспользуемыеПричины Цикл
		НоваяСтрока = ТекущийОбъект.ПричиныИзмененияСтатуса.Добавить();
		НоваяСтрока.Причина = Строка.Причина;
		НоваяСтрока.Порядок = Порядок;
		
		Порядок = Порядок + 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд 

&НаКлиенте
Процедура ИндексКартинкиПриИзменении(Элемент)
	
	Объект.ИмяКартинкиВБиблиотеке = Элементы.ИндексКартинки.СписокВыбора.НайтиПоЗначению(Объект.ИндексКартинки).Представление;
	
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	ДанныеРодительскогоСтатуса = РодительПриИзмененииНаСервере(Объект.Родитель);
	ЗаполнитьЗначенияСвойств(Объект, ДанныеРодительскогоСтатуса);
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокПричинИзмененияСтатуса()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПричиныИзмененияСтатусов.Ссылка КАК Причина,
	|	ПРЕДСТАВЛЕНИЕ(ПричиныИзмененияСтатусов.Ссылка) КАК ПричинаПредставление,
	|	ВЫБОР
	|		КОГДА СтатусыОбъектовПричиныИзмененияСтатуса.Ссылка ЕСТЬ NULL
	|			ТОГДА 99
	|		ИНАЧЕ СтатусыОбъектовПричиныИзмененияСтатуса.Порядок
	|	КОНЕЦ КАК Порядок,
	|	ВЫБОР
	|		КОГДА СтатусыОбъектовПричиныИзмененияСтатуса.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Использовать
	|ИЗ
	|	Справочник.ПричиныИзмененияСтатусов КАК ПричиныИзмененияСтатусов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатусыОбъектов.ПричиныИзмененияСтатуса КАК СтатусыОбъектовПричиныИзмененияСтатуса
	|		ПО ПричиныИзмененияСтатусов.Ссылка = СтатусыОбъектовПричиныИзмененияСтатуса.Причина
	|			И (СтатусыОбъектовПричиныИзмененияСтатуса.Ссылка = &Статус)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Причина";
	Запрос.УстановитьПараметр("Статус", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ПричиныИзменения.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РодительПриИзмененииНаСервере(Знач Родитель)
	
	ИменаРеквизитов = "ИмяКартинкиВБиблиотеке, Порядок, ИндексКартинки";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Родитель, ИменаРеквизитов);
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

#КонецОбласти
